<template>
  <!-- 如果直接在app.vue中定义导航栏的内容和样式的话 那么他的复用性就很差 如果是直接将导航栏相关的内容和样式集成到组件在进行复用的话 结果会好很多 由于导航栏在一个应用中一般只有一个 因此的话 这边的复用指的是多个应用进行共享 -->
  <div id="tab-bar">
    <!-- class属性可以为多个元素重复设置 因此的话 通过class属性来控制导航栏中每一个元素的均分效果 -->
    <!-- 但是呢 如果按照一下写法写的话 导航栏不仅仅要关注自身的内容构成和样式 还需要关注内部个性化的可复用的小组件(他封装为组件复用性才好) 正常情况下 导航栏建议只关注自身构成和样式即可 而内部的小组件的构成和样式交由他的组件内部去完成 -->
    <!-- 而且导航栏内部的小组件构成数量是动态的 因此的话 我们必须内置插槽通过外界去动态插入才行 -->
    <slot></slot>
  </div>
</template>

<script>
  export default {
    name: "TabBar"
  }
</script>

<style scoped>
  #tab-bar {
    /* 设置该元素为水平分布 */
    display: flex;
    /* 设置颜色和其他界面以示区分 设置为浅灰色 */
    background-color: #f2f2f2;
    /* 一般前端开发中 导航栏都有一个默认的高度规范 即49px */
    height: 49px;
    /* 设置导航栏的位置为固定 即随着滚动条的下滑 导航栏的位置不会发生改变 */
    position: fixed;
    /* 然后设置导航栏的位置为底部 并且通过left/right属性控制导航栏占满一行 */
    bottom: 0;
    left: 0;
    right: 0;
    /* 设置阴影 设置的是导航栏像其他界面倾斜的阴影 */
    box-shadow: 0px -3px 10px rgba(150, 150, 150, .2);
  }
</style>
