<template>
  <!-- 现在使用的是原生的js来实现滚动效果 这样实现的效果可能存在卡顿现象 因此的话 我们可以使用第三方框架iscroll来获取更平滑的滚动效果 但是这个框架已经不在维护 现实就是用户出现的重大bug作者已经不会给予更新解决 所以说 在概况见的基础上 国人又推出了better-scroll这个框架 该框架在兼容iscroll的大部分源码的基础上 新增了功能 并且到目前为止仍然在持续更新中 -->
  <!-- 因此我们就可以考虑使用该框架/better-scroll来实现更为平滑的滚动效果 -->
  <!-- 为了考虑和vue的兼容性 我们可以下载早一点版本的better-scroll 即1.13.2 -->
  <!-- 然后就可以学习如何使用这个框架来实现滚动效果了 -->
  <!-- 框架的使用我们可以通过局部滚动来体会 所谓的局部滚动就是不在通过整个页面来实现滚动效果 而是通过局部页面/特定区域来实现滚动效果 所以需要指定区域大小 使用了该框架实现局部滚动的话 那么就需要指定一个指定大小的区域 然后在此区域中只能设置一个元素来实现该元素的上下滚动效果 -->
  <!-- 首先通过原生js来实现局部滚动 这种方式可能存在卡顿现象 并且顶部和底部没有回弹效果 -->
  <div class="wrapper">
    <!-- 如果采用better-scroll框架的话 不仅仅可以实现平滑滚动的效果 而且还可以顺带实现顶部/底部的回弹的效果 同时要注意 必须是指定区域元素中只能含有一个元素 对包裹的元素进行滚动才行 -->
    <ul>
      <li>你是1</li>
      <li>你是2</li>
      <li>你是3</li>
      <li>你是4</li>
      <li>你是5</li>
      <li>你是6</li>
      <li>你是7</li>
      <li>你是8</li>
      <li>你是9</li>
      <li>你是10</li>
      <li>你是11</li>
      <li>你是12</li>
      <li>你是13</li>
      <li>你是14</li>
      <li>你是15</li>
      <li>你是16</li>
      <li>你是17</li>
      <li>你是18</li>
      <li>你是19</li>
      <li>你是20</li>
      <li>你是21</li>
      <li>你是22</li>
      <li>你是23</li>
      <li>你是24</li>
      <li>你是25</li>
      <li>你是26</li>
      <li>你是27</li>
      <li>你是28</li>
      <li>你是29</li>
      <li>你是30</li>
      <li>你是31</li>
      <li>你是32</li>
      <li>你是33</li>
      <li>你是34</li>
      <li>你是35</li>
      <li>你是36</li>
      <li>你是37</li>
      <li>你是38</li>
      <li>你是39</li>
      <li>你是40</li>
      <li>你是41</li>
      <li>你是42</li>
      <li>你是43</li>
      <li>你是44</li>
      <li>你是45</li>
      <li>你是46</li>
      <li>你是47</li>
      <li>你是48</li>
      <li>你是49</li>
      <li>你是50</li>
      <li>你是51</li>
      <li>你是52</li>
      <li>你是53</li>
      <li>你是54</li>
      <li>你是55</li>
      <li>你是56</li>
      <li>你是57</li>
      <li>你是58</li>
      <li>你是59</li>
      <li>你是60</li>
      <li>你是61</li>
      <li>你是62</li>
      <li>你是63</li>
      <li>你是64</li>
      <li>你是65</li>
      <li>你是66</li>
      <li>你是67</li>
      <li>你是68</li>
      <li>你是69</li>
      <li>你是70</li>
      <li>你是71</li>
      <li>你是72</li>
      <li>你是73</li>
      <li>你是74</li>
      <li>你是75</li>
      <li>你是76</li>
      <li>你是77</li>
      <li>你是78</li>
      <li>你是79</li>
      <li>你是80</li>
      <li>你是81</li>
      <li>你是82</li>
      <li>你是83</li>
      <li>你是84</li>
      <li>你是85</li>
      <li>你是86</li>
      <li>你是87</li>
      <li>你是88</li>
      <li>你是89</li>
      <li>你是90</li>
      <li>你是91</li>
      <li>你是92</li>
      <li>你是93</li>
      <li>你是94</li>
      <li>你是95</li>
      <li>你是96</li>
      <li>你是97</li>
      <li>你是98</li>
      <li>你是99</li>
      <li>你是100</li>
    </ul>
<!--    <h1>狸花猫</h1>-->
<!--    <ul>-->
<!--      <li>我是1</li>-->
<!--      <li>我是2</li>-->
<!--      <li>我是3</li>-->
<!--      <li>我是4</li>-->
<!--      <li>我是5</li>-->
<!--      <li>我是6</li>-->
<!--      <li>我是7</li>-->
<!--      <li>我是8</li>-->
<!--      <li>我是9</li>-->
<!--      <li>我是10</li>-->
<!--      <li>我是11</li>-->
<!--      <li>我是12</li>-->
<!--      <li>我是13</li>-->
<!--      <li>我是14</li>-->
<!--      <li>我是15</li>-->
<!--      <li>我是16</li>-->
<!--      <li>我是17</li>-->
<!--      <li>我是18</li>-->
<!--      <li>我是19</li>-->
<!--      <li>我是20</li>-->
<!--      <li>我是21</li>-->
<!--      <li>我是22</li>-->
<!--      <li>我是23</li>-->
<!--      <li>我是24</li>-->
<!--      <li>我是25</li>-->
<!--      <li>我是26</li>-->
<!--      <li>我是27</li>-->
<!--      <li>我是28</li>-->
<!--      <li>我是29</li>-->
<!--      <li>我是30</li>-->
<!--      <li>我是31</li>-->
<!--      <li>我是32</li>-->
<!--      <li>我是33</li>-->
<!--      <li>我是34</li>-->
<!--      <li>我是35</li>-->
<!--      <li>我是36</li>-->
<!--      <li>我是37</li>-->
<!--      <li>我是38</li>-->
<!--      <li>我是39</li>-->
<!--      <li>我是40</li>-->
<!--      <li>我是41</li>-->
<!--      <li>我是42</li>-->
<!--      <li>我是43</li>-->
<!--      <li>我是44</li>-->
<!--      <li>我是45</li>-->
<!--      <li>我是46</li>-->
<!--      <li>我是47</li>-->
<!--      <li>我是48</li>-->
<!--      <li>我是49</li>-->
<!--      <li>我是50</li>-->
<!--      <li>我是51</li>-->
<!--      <li>我是52</li>-->
<!--      <li>我是53</li>-->
<!--      <li>我是54</li>-->
<!--      <li>我是55</li>-->
<!--      <li>我是56</li>-->
<!--      <li>我是57</li>-->
<!--      <li>我是58</li>-->
<!--      <li>我是59</li>-->
<!--      <li>我是60</li>-->
<!--      <li>我是61</li>-->
<!--      <li>我是62</li>-->
<!--      <li>我是63</li>-->
<!--      <li>我是64</li>-->
<!--      <li>我是65</li>-->
<!--      <li>我是66</li>-->
<!--      <li>我是67</li>-->
<!--      <li>我是68</li>-->
<!--      <li>我是69</li>-->
<!--      <li>我是70</li>-->
<!--      <li>我是71</li>-->
<!--      <li>我是72</li>-->
<!--      <li>我是73</li>-->
<!--      <li>我是74</li>-->
<!--      <li>我是75</li>-->
<!--      <li>我是76</li>-->
<!--      <li>我是77</li>-->
<!--      <li>我是78</li>-->
<!--      <li>我是79</li>-->
<!--      <li>我是80</li>-->
<!--      <li>我是81</li>-->
<!--      <li>我是82</li>-->
<!--      <li>我是83</li>-->
<!--      <li>我是84</li>-->
<!--      <li>我是85</li>-->
<!--      <li>我是86</li>-->
<!--      <li>我是87</li>-->
<!--      <li>我是88</li>-->
<!--      <li>我是89</li>-->
<!--      <li>我是90</li>-->
<!--      <li>我是91</li>-->
<!--      <li>我是92</li>-->
<!--      <li>我是93</li>-->
<!--      <li>我是94</li>-->
<!--      <li>我是95</li>-->
<!--      <li>我是96</li>-->
<!--      <li>我是97</li>-->
<!--      <li>我是98</li>-->
<!--      <li>我是99</li>-->
<!--      <li>我是100</li>-->
<!--    </ul>-->
  </div>

</template>

<script>
  // 导入better-scroll框架
  import BScroll from 'better-scroll'
  export default {
    name: "Cat2",
    // created方法表示组件创建完毕 并没有挂载到dom上/生成dom 因此无法使用组件中的某一个dom
    // 如果想要使用组件中的dom 可以在mounted方法中使用
    mounted() {
      new BScroll('.wrapper', {

      })
      // 当然 你也可以通过document.querySelector的方式找到指定dom 也可以通过$refs的方式找到指定dom($refs不仅仅可以访问子组件 还可以访问当前组件中指定了ref属性的元素)
    }
  }
</script>

<style scoped>
  h1 {
    color: orange
  }
  /*ul {*/
  /*  height: 100px;*/
  /*  background-color: red;*/
  /*  !* 设置超出的部分裁剪 并且通过滚动的方式显示 *!*/
  /*  overflow-y: scroll;*/
  /*}*/
  .wrapper {
    height: 100px;
    background-color: red;
    /* 设置超出部分以滚动的方式展示 */
    /*overflow-y: scroll;*/
    /* 但是 移动端上是没有鼠标拖动滚动条的 因此 滚动条在移动端中就没有应用价值 因此的话 我们需要隐藏滚动条 通过手指的上下滑动实现 */
    overflow: hidden;
  }
</style>
